sad-zz/web-monitoring-Intelligent-Vehicle-Traffic-/stm32-firmware/Core/Src/main.c
/**
 * @file main.c
 * @brief STM32F103C8T6 port of RATCX1 traffic counter firmware
 *
 * Original device: dsPIC30F4011 (mikroC compiler, MPLAB IDE)
 * Target device:   STM32F103C8T6 (Blue Pill) + W5500 Ethernet module
 * Toolchain:       STM32CubeIDE / arm-none-eabi-gcc + STM32 HAL
 *
 * ─── Pin Assignments ──────────────────────────────────────────────────
 *
 *  PA0  – ADC1_IN0   Battery voltage (VBAT)
 *  PA1  – ADC1_IN1   Solar panel voltage
 *  PA2  – TIM2_CH3   Input Capture from loop oscillator MUX output
 *  PA4  – GPIO Out   W5500 /CS  (SPI1 chip-select)
 *  PA5  – SPI1_SCK   W5500 clock
 *  PA6  – SPI1_MISO  W5500 MISO
 *  PA7  – SPI1_MOSI  W5500 MOSI
 *  PA9  – USART1_TX  Debug / config serial port (115200 baud)
 *  PA10 – USART1_RX
 *
 *  PB0  – GPIO Out   Loop MUX select A (LSB of 2-bit address → selects loop 0-3)
 *  PB1  – GPIO Out   Loop MUX select B (MSB)
 *  PB2  – GPIO Out   W5500 /RST (active-low reset)
 *  PB3  – GPIO In    W5500 INT  (optional interrupt pin)
 *  PB5  – GPIO Out   onloop[0] LED indicator
 *  PB6  – GPIO Out   onloop[1] LED indicator
 *  PB7  – GPIO Out   onloop[2] LED indicator
 *  PB8  – GPIO Out   onloop[3] LED indicator
 *  PB9  – GPIO Out   connection_state LED
 *  PB10 – GPIO Out   charge_control output
 *
 *  PC13 – GPIO Out   System heartbeat LED (Blue Pill built-in, active-low)
 *
 * ─── External hardware ────────────────────────────────────────────────
 *  Loop oscillator: 4 inductive loops → 4:1 analogue mux (e.g. CD4052)
 *    Mux A = PB0, Mux B = PB1
 *    Mux output → PA2 (TIM2_CH3 Input Capture)
 *    Oscillator frequency ~100-200 kHz (square wave)
 *
 *  W5500 Ethernet module connected via SPI1 (as above)
 *
 * ─── Clock configuration ──────────────────────────────────────────────
 *  HSE = 8 MHz crystal → PLL × 9 = 72 MHz SYSCLK
 *  AHB  = 72 MHz
 *  APB1 = 36 MHz (max for APB1)
 *  APB2 = 72 MHz
 *
 * ─── Build notes ──────────────────────────────────────────────────────
 *  1. Create a new STM32F103C8T6 project in STM32CubeIDE
 *  2. Enable: TIM2 (CH3 IC), TIM4 (base), USART1, SPI1, ADC1 (CH0+CH1)
 *  3. Copy Core/Src/*.c and Core/Inc/*.h to your project
 *  4. Download WIZnet ioLibrary_Driver and follow Drivers/W5500/README.md
 *  5. Un-comment the ioLibrary calls in w5500_tcp.c
 *  6. Build and flash with ST-Link
 */

#include "main.h"
#include "stm32f1xx_hal.h"
#include <string.h>
#include <stdio.h>

#include "config.h"
#include "variables.h"
#include "loop_detector.h"
#include "classification.h"
#include "interval.h"
#include "protocol.h"
#include "w5500_tcp.h"

/* ─── HAL peripheral handles ─────────────────────────────────────────── */
TIM_HandleTypeDef  htim2;   /* Input Capture @1MHz                        */
TIM_HandleTypeDef  htim4;   /* 1ms tick                                   */
UART_HandleTypeDef huart1;  /* Debug / config serial port                 */
SPI_HandleTypeDef  hspi1;   /* W5500 SPI                                  */
ADC_HandleTypeDef  hadc1;   /* Battery + solar ADC                        */

/* ─── Global variables (defined here, declared extern in variables.h) ── */
volatile uint16_t error_byte         = 0;
volatile uint16_t error_byte_last    = 0;
volatile int16_t  timer_1_sec        = 0;
volatile int32_t  milisec            = 0;
volatile uint32_t how_many_micro     = 0;
volatile int16_t  onloop[4]          = {0};
volatile int16_t  Line_Dir[2]        = {0};
volatile int16_t  timexen[2]         = {0};
volatile int32_t  timex[2]           = {0};
volatile int16_t  current_loop       = 0;
volatile int16_t  docal              = 0;
volatile int16_t  forth              = 0;
volatile int32_t  current_gap[2]     = {0};
volatile int16_t  loop_error_tmp     = 0;
volatile uint32_t capw=0, capx=0, capy=0, capz=0;
volatile uint32_t freq_mean[4]       = {0};
volatile uint32_t caldata[4]         = {0};
volatile uint32_t calsum[4]          = {0};
volatile uint16_t calpointer[4]      = {0};
volatile float    freq_help          = 0;
volatile int16_t  dev[4]             = {0};
volatile uint32_t totalv1a=0,totalv1b=0,totalv1c=0,totalv1d=0,totalv1e=0,totalv1x=0;
volatile uint32_t totalv2a=0,totalv2b=0,totalv2c=0,totalv2d=0,totalv2e=0,totalv2x=0;
volatile int32_t  l1occ=0, l2occ=0;
volatile int32_t  vbat=0, solar=0;
volatile int16_t  line1step=0, line2step=0;
volatile int32_t  T1[2]={0}, T2[2]={0}, T3[2]={0};
volatile int32_t  T2S=0;
volatile uint8_t  cal_class0=0, cal_class1=0;
volatile RTC_Time_t current_time     = {25,1,1,0,0,0}; /* default: 2025-01-01 */

char datetimesec[22] = "2025.01.01-00:00:00.0";
char interval_data[512];

int loop[4];
int MARGINTOP, MARGINBOT;
int loop_distance, loop_width;
int LIMX_val, LIMA_val, LIMB_val, LIMC_val, LIMD_val, LIMITE_val;
int DSPEED1_val, NSPEED1_val, DSPEED2_val, NSPEED2_val;
int AUTCAL_val, HMM, power_type;

uint16_t cal_interval_cnt;
uint16_t cal_timer[4];
IntervalData_t current_interval;
Vehicle_t lastvehicle;

/* ─── Private function prototypes ────────────────────────────────────── */
static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM4_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC1_Init(void);
static void load_config(void);
static void read_adc(void);
static void debug_print(const char *s);

/* ─── ADC channel read helper ────────────────────────────────────────── */
static uint32_t adc_read_channel(uint32_t channel)
{
    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel      = channel;
    sConfig.Rank         = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_55CYCLES_5;
    HAL_ADC_ConfigChannel(&hadc1, &sConfig);
    HAL_ADC_Start(&hadc1);
    HAL_ADC_PollForConversion(&hadc1, 10);
    return HAL_ADC_GetValue(&hadc1);
}

/* ─────────────────────────────────────────────────────────────────────── */
/*                                main()                                   */
/* ─────────────────────────────────────────────────────────────────────── */
int main(void)
{
    /* ── HAL + Clock init ─────────────────────────────────────────────── */
    HAL_Init();
    SystemClock_Config();

    /* ── Peripheral init ──────────────────────────────────────────────── */
    MX_GPIO_Init();
    MX_TIM2_Init();
    MX_TIM4_Init();
    MX_USART1_UART_Init();
    MX_SPI1_Init();
    MX_ADC1_Init();

    /* ── Load configuration from config.h defaults ────────────────────── */
    load_config();

    /* ── Reset interval data ──────────────────────────────────────────── */
    reset_interval_data();
    reset_interval();

    /* ── Start loop detector (TIM2 IC + TIM4 tick) ────────────────────── */
    loop_detector_init();

    debug_print("RATCX1-STM32 started\r\n");

    /* ── Calibrate loops (all loops must be free of vehicles) ─────────── */
    debug_print("Calibrating loops...\r\n");
    HAL_Delay(500);
    loop_calibrate();
    debug_print("Calibration done\r\n");

    /* ── Initialise W5500 Ethernet ────────────────────────────────────── */
    if (w5500_init() != 0) {
        set_error(MMC_ERR);   /* reuse error bit to signal network init fail */
        debug_print("W5500 init failed\r\n");
    } else {
        debug_print("W5500 ready\r\n");
    }

    /* ── Initialise protocol layer ────────────────────────────────────── */
    protocol_init();

    /* ── Initialise cal timers ────────────────────────────────────────── */
    memset(cal_timer, 0, sizeof(cal_timer));

    /* ═══════════════════════════════════════════════════════════════════ */
    /*                         MAIN LOOP                                   */
    /* ═══════════════════════════════════════════════════════════════════ */
    while (1)
    {
        /* ── Vehicle classification (set by TIM4 ISR) ─────────────────── */
        if (cal_class0 > 0) {
            cal_class(0);
            cal_class0 = 0;
        }
        if (cal_class1 > 0) {
            cal_class(1);
            cal_class1 = 0;
        }

        /* ── 1-second tasks ───────────────────────────────────────────── */
        if (timer_1_sec == 1)
        {
            timer_1_sec = 0;

            /* Heartbeat LED toggle (PC13, active-low) */
            HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);

            /* Adaptive baseline: gradually update caldata toward current freq_mean */
            for (int i = 0; i < 4; i++) {
                cal_timer[i]++;
                if (cal_timer[i] > 30) {
                    caldata[i] = (caldata[i] + freq_mean[i]) / 2;
                }
            }

            /* Reset stale lane state machines */
            if (!onloop[0] && !onloop[1]) reset_class(0);
            if (!onloop[2] && !onloop[3]) reset_class(1);

            /* ADC readings */
            read_adc();

            /* ── 5-minute interval boundary ──────────────────────────── */
            if (current_time.second == 0 &&
                (current_time.minute % INTERVAL_PERIOD) == 0)
            {
                cal_interval();
                debug_print("Interval ready\r\n");
            }

            /* ── Error indicators on LEDs ────────────────────────────── */
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, onloop[0] ? GPIO_PIN_SET : GPIO_PIN_RESET);
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, onloop[1] ? GPIO_PIN_SET : GPIO_PIN_RESET);
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, onloop[2] ? GPIO_PIN_SET : GPIO_PIN_RESET);
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, onloop[3] ? GPIO_PIN_SET : GPIO_PIN_RESET);
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9,
                protocol_is_connected() ? GPIO_PIN_SET : GPIO_PIN_RESET);
        }

        /* ── Protocol task (TCP communication) ───────────────────────── */
        protocol_task();
    }
}

/* ─── load_config ────────────────────────────────────────────────────── */
/**
 * Load configuration from compile-time defaults in config.h.
 * In a production build these could be loaded from Flash (emulated EEPROM)
 * via HAL_FLASH_Program() / HAL_FLASH_Read().
 */
static void load_config(void)
{
    loop[0] = LOOP0_EN;
    loop[1] = LOOP1_EN;
    loop[2] = LOOP2_EN;
    loop[3] = LOOP3_EN;

    loop_distance = LOOP_DISTANCE;
    loop_width    = LOOP_WIDTH;
    MARGINTOP     = MARGIN_TOP;
    MARGINBOT     = MARGIN_BOT;

    LIMX_val   = LIMX;
    LIMA_val   = LIMA;
    LIMB_val   = LIMB;
    LIMC_val   = LIMC;
    LIMD_val   = LIMD;
    LIMITE_val = LIMITE;

    DSPEED1_val = DSPEED1;
    NSPEED1_val = NSPEED1;
    DSPEED2_val = DSPEED2;
    NSPEED2_val = NSPEED2;

    AUTCAL_val = AUTCAL;
    power_type = POWER_TYPE;
    HMM        = 10;

    /* Ensure at least one loop is active */
    if (loop[0]+loop[1]+loop[2]+loop[3] == 0) {
        loop[0] = loop[1] = 1;
    }
}

/* ─── read_adc ───────────────────────────────────────────────────────── */
static void read_adc(void)
{
    vbat  = (int32_t)adc_read_channel(ADC_CHANNEL_0);  /* PA0 */
    solar = (int32_t)adc_read_channel(ADC_CHANNEL_1);  /* PA1 */

    /* Battery low */
    if (vbat < VBAT_LOW_ADC) set_error(LBT_ERR);
    else                      reset_error(LBT_ERR);

    /* Solar / power checks */
    if (power_type == POWER_TYPE_SOLAR) {
        if (current_time.hour > 10 && current_time.hour < 14 &&
            solar < VSOL_LOW_ADC)
            set_error(SOL_ERR);
        if (solar > VSOL_HIGH_ADC)
            reset_error(SOL_ERR);
    }
}

/* ─── debug_print ────────────────────────────────────────────────────── */
static void debug_print(const char *s)
{
    HAL_UART_Transmit(&huart1, (uint8_t *)s, (uint16_t)strlen(s), 100);
}

/* ─────────────────────────────────────────────────────────────────────── */
/*                       HAL IRQ callbacks                                 */
/* ─────────────────────────────────────────────────────────────────────── */

/** TIM4 period elapsed – 1ms tick */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM4) {
        loop_detector_isr();
    }
}

/** TIM4 and TIM2 IRQ handlers – forward to HAL */
void TIM4_IRQHandler(void)  { HAL_TIM_IRQHandler(&htim4); }
void TIM2_IRQHandler(void)  { HAL_TIM_IRQHandler(&htim2); }

/* ─────────────────────────────────────────────────────────────────────── */
/*                     Peripheral initialisation                           */
/* ─────────────────────────────────────────────────────────────────────── */

static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /* Use 8MHz HSE with PLL × 9 = 72MHz */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL     = RCC_PLL_MUL9;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                       RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2);
}

static void MX_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    /* ── Outputs ──────────────────────────────────────────────────────── */
    /* PA4 = W5500 /CS, PA8 = spare */
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);  /* CS idle high */
    GPIO_InitStruct.Pin   = GPIO_PIN_4;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* PB0=MUX_A, PB1=MUX_B, PB2=W5500_RST, PB5-PB10 = status outputs */
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, GPIO_PIN_SET);  /* RST idle high */
    GPIO_InitStruct.Pin  = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 |
                           GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
                           GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Speed= GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* PC13 = status LED (active-low on Blue Pill) */
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    GPIO_InitStruct.Pin  = GPIO_PIN_13;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Speed= GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    /* ── Inputs ───────────────────────────────────────────────────────── */
    /* PB3 = W5500 INT (optional) */
    GPIO_InitStruct.Pin  = GPIO_PIN_3;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
}

static void MX_TIM2_Init(void)
{
    /* TIM2: 32-bit free-running counter at 1MHz for Input Capture
     * PA2 = TIM2_CH3 (Input Capture) */
    TIM_IC_InitTypeDef   sConfigIC = {0};

    __HAL_RCC_TIM2_CLK_ENABLE();

    htim2.Instance               = TIM2;
    htim2.Init.Prescaler         = TIM2_PSC;     /* 72MHz/72 = 1MHz */
    htim2.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim2.Init.Period             = 0xFFFFFFFF;   /* 32-bit auto-reload */
    htim2.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    HAL_TIM_IC_Init(&htim2);

    sConfigIC.ICPolarity  = TIM_ICPOLARITY_RISING;
    sConfigIC.ICSelection = TIM_ICSELECTION_DIRECTTI;
    sConfigIC.ICPrescaler = TIM_ICPSC_DIV1;
    sConfigIC.ICFilter    = 0x0;
    HAL_TIM_IC_ConfigChannel(&htim2, &sConfigIC, TIM_CHANNEL_3);

    /* Configure PA2 as TIM2_CH3 alternate function */
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin       = GPIO_PIN_2;
    GPIO_InitStruct.Mode      = GPIO_MODE_INPUT;     /* AF input floating for TIM */
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(TIM2_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
}

static void MX_TIM4_Init(void)
{
    /* TIM4: 1ms interrupt tick
     * PSC=71, ARR=999 → 72MHz / 72 / 1000 = 1000 Hz = 1ms */
    __HAL_RCC_TIM4_CLK_ENABLE();

    htim4.Instance               = TIM4;
    htim4.Init.Prescaler         = TIM4_PSC;
    htim4.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim4.Init.Period             = TIM4_ARR;
    htim4.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
    HAL_TIM_Base_Init(&htim4);

    HAL_NVIC_SetPriority(TIM4_IRQn, 0, 0);  /* highest priority for timing */
    HAL_NVIC_EnableIRQ(TIM4_IRQn);
}

static void MX_USART1_UART_Init(void)
{
    /* USART1: PA9=TX, PA10=RX, 115200 8N1 (same as original UART1) */
    __HAL_RCC_USART1_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin   = GPIO_PIN_9;            /* TX */
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin  = GPIO_PIN_10;            /* RX */
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    huart1.Instance          = USART1;
    huart1.Init.BaudRate     = 115200;
    huart1.Init.WordLength   = UART_WORDLENGTH_8B;
    huart1.Init.StopBits     = UART_STOPBITS_1;
    huart1.Init.Parity       = UART_PARITY_NONE;
    huart1.Init.Mode         = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl   = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&huart1);
}

static void MX_SPI1_Init(void)
{
    /* SPI1: PA5=SCK, PA6=MISO, PA7=MOSI (W5500) */
    __HAL_RCC_SPI1_CLK_ENABLE();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    /* SCK + MOSI as AF push-pull */
    GPIO_InitStruct.Pin   = GPIO_PIN_5 | GPIO_PIN_7;
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    /* MISO as input floating */
    GPIO_InitStruct.Pin  = GPIO_PIN_6;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    hspi1.Instance               = SPI1;
    hspi1.Init.Mode              = SPI_MODE_MASTER;
    hspi1.Init.Direction         = SPI_DIRECTION_2LINES;
    hspi1.Init.DataSize          = SPI_DATASIZE_8BIT;
    hspi1.Init.CLKPolarity       = SPI_POLARITY_LOW;
    hspi1.Init.CLKPhase          = SPI_PHASE_1EDGE;
    hspi1.Init.NSS               = SPI_NSS_SOFT;
    hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_4;  /* 72/4=18MHz */
    hspi1.Init.FirstBit          = SPI_FIRSTBIT_MSB;
    hspi1.Init.TIMode            = SPI_TIMODE_DISABLE;
    hspi1.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLE;
    HAL_SPI_Init(&hspi1);
}

static void MX_ADC1_Init(void)
{
    /* ADC1: CH0=PA0 (VBAT), CH1=PA1 (Solar) */
    __HAL_RCC_ADC1_CLK_ENABLE();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin  = GPIO_PIN_0 | GPIO_PIN_1;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    hadc1.Instance                   = ADC1;
    hadc1.Init.ScanConvMode          = ADC_SCAN_DISABLE;
    hadc1.Init.ContinuousConvMode    = DISABLE;
    hadc1.Init.DiscontinuousConvMode = DISABLE;
    hadc1.Init.ExternalTrigConv      = ADC_SOFTWARE_START;
    hadc1.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
    hadc1.Init.NbrOfConversion       = 1;
    HAL_ADC_Init(&hadc1);
    HAL_ADCEx_Calibration_Start(&hadc1);
}

/* ─── HAL MSP (Minimal System Platform) stubs ───────────────────────── */
void HAL_MspInit(void)
{
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_RCC_PWR_CLK_ENABLE();
    /* Disable JTAG to free PB3/PB4/PA15 as GPIO */
    __HAL_AFIO_REMAP_SWJ_NOJTAG();
}

/* ─── Error handler ──────────────────────────────────────────────────── */
void Error_Handler(void)
{
    __disable_irq();
    while (1) {
        HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
        HAL_Delay(100);
    }
}
